const npc = {
    npcNames () {
        const names = [
            '张雅琪', '李欣怡', '王芷若', '赵思涵', '刘梦琪', '陈语嫣', '周婧琪', '吴婉儿', '黄雨婷', '徐雪莹',
            // '孙诗涵', '高静琪', '何晓萱', '郑心怡', '梁梓萱', '谢梦瑶', '罗雨萱', '许芷萱', '冯可馨', '程芷若',
            // '蔡欣妍', '邓婉婷', '郭慧妍', '叶思敏', '马婧雯', '林雨欣', '苏若馨', '卢悦琳', '丁雅婷', '唐梦婷',
            // '萧语彤', '宋诗雅', '许晓蕾', '韩芷涵', '章欣悦', '沈静茹', '魏婉君', '姜雨薇', '秦梓涵', '陶思琪',
            // '袁婧涵', '蒋语嫣', '胡婉清', '余怡然', '陆梦洁', '钱芷若', '严雅静', '曹思颖', '江晓燕', '方雨欣'
        ];
        return names;
    },
    // 随机输出数组中的10个对象
    // getRandomObjects () {
    //     const names = [
    //         '张雅琪', '李欣怡', '王芷若', '赵思涵', '刘梦琪', '陈语嫣', '周婧琪', '吴婉儿', '黄雨婷', '徐雪莹',
    //         '孙诗涵', '高静琪', '何晓萱', '郑心怡', '梁梓萱', '谢梦瑶', '罗雨萱', '许芷萱', '冯可馨', '程芷若',
    //         '蔡欣妍', '邓婉婷', '郭慧妍', '叶思敏', '马婧雯', '林雨欣', '苏若馨', '卢悦琳', '丁雅婷', '唐梦婷',
    //         '萧语彤', '宋诗雅', '许晓蕾', '韩芷涵', '章欣悦', '沈静茹', '魏婉君', '姜雨薇', '秦梓涵', '陶思琪',
    //         '袁婧涵', '蒋语嫣', '胡婉清', '余怡然', '陆梦洁', '钱芷若', '严雅静', '曹思颖', '江晓燕', '方雨欣'
    //     ];
    //     const randomObjects = [];

    //     for (let i = 0; i < 10; i++) {
    //         const randomIndex = Math.floor(Math.random() * names.length);
    //         randomObjects.push(names[randomIndex]);
    //     }

    //     return randomObjects;
    // }
};

export default npc;